//////////////////////////////////////////////////////////////////////////////////
//	
//	Общий модуль: Общего назначения (вызов сервера)
//	
//	Автор и разработчик: Мизгирев Ярослав Михайлович
//	При поддержке участников сообщества GitHub
//	https://github.com/YaroslavMizgirev/1C
//	telegram: https://t.me/YaroslavMizgirev
//	
//////////////////////////////////////////////////////////////////////////////////

#Если Сервер Тогда

#Область ПрограммныйИнтерфейс

#Область Данные

// Функция - Значения реквизитов объекта
//  Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
//  Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект для быстрого чтения отдельных реквизитов объекта из базы данных.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя, то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Источник						 - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//  										 - Строка - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты						 - Строка - имена реквизитов, перечисленные через запятую, в формате требований к свойствам структуры. Например, "Код, Наименование, Родитель".
//  										 - Структура
//  										 - ФиксированнаяСтруктура - в качестве ключа передается псевдоним поля для возвращаемой структуры с результатом, а в качестве значения (опционально) фактическое имя поля в таблице. Если ключ задан, а значение не определено, то имя поля берется из ключа. Допускается указание имени поля через точку, но при этом параметр КодЯзыка для такого поля учитываться не будет.
//  										 - Массив из Строка
//  										 - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные	 - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя; если есть ограничение на уровне записей, то все реквизиты вернутся со значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение; если Ложь, то возникнет исключение при отсутствии прав на таблицу или любой из реквизитов.
//
// Возвращаемое значение:
//   Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//              Если в параметр Ссылка передана пустая ссылка, то возвращается структура, 
//              соответствующая именам реквизитов со значениями Неопределено.
//              Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//              то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Источник, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, Реквизиты, ВыбратьРазрешенные);
	
КонецФункции

// Функция - Получить значение реквизита объекта.
//  Возвращает значения реквизита, прочитанного из информационной базы по ссылке на объект.
//  Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект для быстрого чтения отдельных реквизитов объекта из базы данных.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя, то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Источник			 - СсылкаНаОбъектИнформационнойБазыИлиОбсуждениеСистемыВзаимодействия - объект, значения реквизитов которого необходимо получить.
//  							 - Строка - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита	 - Строка - имя получаемого реквизита.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя; если есть ограничение на уровне записей, то возвращается Неопределено; если нет прав для работы с таблицей, то возникнет исключение; если Ложь, то возникнет исключение при отсутствии прав на таблицу или любой из реквизитов.
// 
// Возвращаемое значение:
//   - Произвольный - зависит от типа значения прочитанного реквизита.
//   - Неопределено - если в параметр Ссылка передана пустая ссылка, или если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка).
//
Функция ЗначениеРеквизитаОбъекта(Источник, ИмяРеквизита, ВыбратьРазрешенные=Истина) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, ИмяРеквизита, ВыбратьРазрешенные);
	
КонецФункции

#КонецОбласти

#Область Метаданные

// Проверка того, что переданный тип является ссылочным типом данных.
//  Для типа Неопределено возвращается Ложь.
//
// Параметры:
//  ПроверяемыйТип - Тип - для проверки на ссылочный тип данных.
//
// Возвращаемое значение:
//  Булево - Истина, если это ссылка.
//
Функция ЭтоСсылка(ПроверяемыйТип) Экспорт
	
	Возврат ОбщегоНазначения.ЭтоСсылка(ПроверяемыйТип);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
