
#Если Сервер Тогда
	
	#Область ПрограммныйИнтерфейс
	
	#Область ОписаниеТипа
	
	#Область ПланыВидовХарактеристик
	
	// Возврат массива типов значений характеристик заданного Плана видов характеристик.
	//
	// Параметры:
	//  ИмяПланаВидовХарактеристик - Строка - Имя плана видов характеристик.
	// 
	// Возвращаемое значение:
	//   - МассивТипов - Массив Из Тип(Произвольный) - Массив типов значений характеристик.
	//
	Функция МассивТиповХарактеристик(ИмяПланаВидовХарактеристик) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПланВидовХарактеристик.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	&ПланВидовХарактеристик КАК ПланВидовХарактеристик";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПланВидовХарактеристик", "ПланВидовХарактеристик." + _ОбработкаСтрок.ОчиститьОтЗапрещенныхСимволов(ИмяПланаВидовХарактеристик));
		РезультатЗапроса = Запрос.Выполнить();
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТипЗначения");
		
	КонецФункции
	
	#КонецОбласти
	
	#КонецОбласти
	
	#КонецОбласти
	
#КонецЕсли
